[
  {
    "id": "mf_white_witch",
    "source": "SSC",
    "name": "WHITE WITCH",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 28,
    "description": "A proof-of-concept more than a line production chassis, a select few White Witch models have been released via Smith Shimano’s LUX-EXOTIC group, only available to select pilots outside of SSC’s Constellar security services. The White Witch builds from the platform established by the Black Witch; utilizing SSC’s magtech weapons and equipment, the White Witch takes the BW platform and tunes it for hyper-solipsistic focus, narrowing the effect cone to encompass only the WW and its pilot.<br>The White Witch marks SSC’s first foray into null-ordinance/ environmental manipulation chassis: when active, the WW’s entire chassis becomes a conduit for onboard base-compound magtech agitators to exploit its immediate environment, drawing atomic components out of natural, organic, and inorganic objects and surfaces to enhance its built-in defensive systems. The White Witch reorganizes these molecular draws using its chassis as substrate, quickly forming substantive defenses and weapons from “thin air”.<br>This process has understandably traumatic effects on organic and inorganic materials inside the immediate effect cone.",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "armor": 0,
      "hp": 7,
      "evasion": 10,
      "edef": 6,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 5,
      "tech_attack": 0,
      "save": 11,
      "speed": 6,
      "sp": 6
    },
    "traits": [
      {
        "name": "Rooted",
        "description": "While this mech is immobilized, it has resistance to kinetic damage and cannot be knocked prone. It can immobilize itself until the end of its next turn as a quick action."
      },
      {
        "name": "Harden",
        "description": "When this mech braces, it gains overshield 5 before taking damage."
      },
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use this mech as hard cover."
      }
    ],
    "core_system": {
      "name": "FERROREACTIVE SHELL",
      "description": "“The first test nearly ended the program. Exotic Materials is a... liberal department within the Constellation, but even our executives were hesitant to approve a second run. The data generated by WW_01 was invaluable, and we were sure we could get it right with a second test — all we needed was the sigma on its rewrite cone! Suits just get leery when systems fail. They forget that progress takes blood — sometimes literally — as payment for a breakthrough.”",
      "active_name": "Hyperactive mode",
      "active_effect": "For the rest of this scene, your ferroreactive armor gain increases to 2, and its maximum armor increase is 12.<br>Each time your armor increases from this system, your mech releases a burst 1 aoe that deals 1 AP kinetic damage to all characters and objects in the zone, as it draws raw material from the environment.<br>However, if your ferroreactive armor would increase past 12, the armor explodes instead, dealing 1 AP kinetic damage in a burst 2 radius around your mech and causing all characters within to pass a hull save or be knocked prone, then immobilized and shredded until the end of their next turns. The ferroreactive armor is reset to 0. It continues to be active and this effect can occur multiple times a scene.",
      "tags": [
        {
          "id": "tg_protocol"
        }
      ],
      "passive_name": "Ferroreactive Armor",
      "passive_effect": "Each time this mech takes damage from a source owned by a hostile character (even if that damage is reduced or ignored), increase it’s armor by 1 for the rest of this scene, up to a maximum increase of 6 (you can use a die to track this)."
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/DQHJ8Sq.png",
    "counters": [
      {
        "id": "ctr_ferroreactive_armor",
        "name": "FERROREACTIVE ARMOR",
        "default_value": 0,
        "min": 0,
        "max": 12
      }
    ]
  },
  {
    "id": "mf_emperor",
    "source": "SSC",
    "name": "EMPEROR",
    "mechtype": [
      "Support",
      "Artillery"
    ],
    "y_pos": 21,
    "description": "“In Exotic Materials we don’t have problems. We have doors that are not yet open to us — a ‘problem’ presents endless branching paths; ‘doors’ are binary. Open and shut. The tyranny of the problem lies in the impossible breadth of possibility — a useless framing for tinkerers and hobbyists with time to fret over ethics as-defined by calcified, hand-wringing institutions. EXMAT instead is solutions-focused: there is no such thing as a problem, only a door, and the question: can we open it, or do we have to bash it down?<br>For the Emperor we had to bash the door down. Ugly process but the content beyond the door is more than worth it: Syncretic subjectivities, induced gestalt manifestation, H-NHP ontologic bridging, superpositional defensive lensing — look at what the battering ram gave us and tell me you’d rather puzzle out a problem then bash down the door.<br>Progress. The Corpro has always been about progress. Humanity has always been about progress. In service of progress, one must accept the necessity of teleological suspension, for it gives us wondrous, necessary things.<br>What else is there to say? Long live the Emperor, for in its creation did we find the method by which to fling open every locked door. Wondrous things are coming, and I’m glad as hell that they’ll be under our control.”<br>— Memo to personal records, Bala Shimano, CEO-1, Exotic Materials Group",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "armor": 0,
      "hp": 2,
      "evasion": 10,
      "edef": 8,
      "heatcap": 5,
      "repcap": 2,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 7
    },
    "traits": [
      {
        "name": "Storm Shield",
        "description": "The Emperor’s hp does not increase due to grit. Instead, at the start of any scene, the Emperor gains overshield equal to 6 + its grit. This overshield refreshes when you take structure damage."
      },
      {
        "name": "Imperial Vestment",
        "description": "Whenever the Emperor grants overshield to another character, it gains the same amount of overshield. If the Emperor gains overshield from any source, including this trait, it increases its current overshield by that amount instead of replacing it. In addition, if that overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced). The Emperor’s current overshield cannot exceed the amount granted by Storm Shield."
      },
      {
        "name": "Sovereign Presence",
        "description": "1/round, when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 AOE around itself (if it was hit) or its target (if it was the attacker) that deals 1 AP energy damage to all characters caught within other than the Emperor."
      }
    ],
    "core_system": {
      "name": "Darian Regalia",
      "description": "",
      "active_name": "Xerxes Apex",
      "active_effect": "For the rest of this scene, when the Marathon Arc is drawn back, each hostile mech character hit and each allied mech character granted overshield by the bow releases a bolt of lightning, striking a character in range 3, which could be the character it originated from. This lightning bolt either deals 2 AP damage (no attack or save) or grants 2 overshield (or increases overshield by the same amount). The same character can be struck by multiple bolts.",
      "tags": [],
      "integrated": {
        "id": "mw_emperor_integrated"
      }
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/BGu6Vg6.png"
  },
  {
    "id": "mf_kidd",
    "source": "IPS-N",
    "name": "KIDD",
    "mechtype": [
      "Support"
    ],
    "y_pos": 25,
    "description": "Sidegraded from IPS-N’s Lancaster support frame, the Kidd was produced under a joint development contract by IPS-N’s Titan-Enceladus Field Project and Northstar Branch Robotics. The original frame pattern was bought off a mining commune that had rigged their support drones in a slapdash but ingenious neural mesh that both hardened them against tech intrusion and increased their operational efficiency many times over. Urban legend was that the original rig builder had used his drone team to bury caches of black market volador tech in several wandering asteroids, and out of extreme paranoia made his systems almost impossible to crack. To this day Northstar Robotics tries valiantly to squash down persistent rumors that clues to the location of the caches are hidden in the Kidd’s code base.<br>Designed to provide an aggressive, all-theater support solution to rugged field teams in hostile environments, the Kidd mounts a trio of powerful systems to ensure a broad operational envelope. The Jolly Roger semi-autonomous personal orbital platform, bundled with all proven-license Kidd platforms establishes theater control in any open or near-surface environment. A squadron of bundled WARCHILD subalterns (and onboard maintenance suite) guarantee friendly support in any environment, and provide a broad suite of tactical possibility. Finally, Titan-Enceladus’ SMOKESTACK heat sink pylon represents the cutting edge of IPS-N’s thermodynamic axiomatics, allowing users to offset an amount of heat via the creation of a pinhole-window into an Omega State of absolute zero.",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "armor": 2,
      "hp": 6,
      "evasion": 6,
      "edef": 12,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 6,
      "sp": 10
    },
    "traits": [
      {
        "name": "Rapid Deploy",
        "description": "On its first turn in any combat scene, the Kidd can deploy or activate any one system with the drone or deployable tag as a free action."
      },
      {
        "name": "Re-Route Power",
        "description": "As a quick action 1/round, the Kidd can destroy one of its deployables or drones to either grant 1d6+3 overshield to an adjacent ally to that drone or system or deal 1d6+3 ap energy damage to an adjacent enemy to that drone or system. It can’t do this to a drone or deployable that was deployed or created in the same round. Systems without the limited tag destroyed this way must be repaired before becoming usable again."
      },
      {
        "name": "Recycle",
        "description": "If the Kidd used Re-Route power in any scene, it gets +1 limited charge back to a system of its choice with the drone or deployable tag."
      }
    ],
    "core_system": {
      "name": "Jolly Roger Semi-Autonomous Personal Orbital Platform",
      "description": "",
      "active_name": "Skull and Bones",
      "active_effect": "For the rest of the scene the Kidd, the Roger’s first two effects become blast 2 and its beam weapon affects all characters in a line 15 area.",
      "tags": [],
      "passive_name": "Jolly Roger",
      "passive_effect": "At the start of any combat scene, the Kidd activates an uplink to a paired <i>Jolly Roger</i>, a orbital satellite weapon. The <i>Roger</i> needs to maintain calibration with the Kidd, which you can track with the Jolly Roger die (d6, starting at 1). When one of the following occurs, tick the die up by 1:<ul><li>The Kidd deploys a drone or deployable system</li><li>The Kidd takes a tech action targeting at least one ally</li></ul>Each of these effects can trigger only 1/round independently. However, the die also ticks up by 1 each time a hostile character takes a tech action against an allied character in the Kidd’s sensor range, with no limit.<br>As a quick action 1/round, the Kidd can activate a function of the <i>Roger</i>, resetting the die to 1. It can take one of the following actions, depending on the value of the die:<ul><li><b>3+:</b> Scan every enemy in a blast 1 area and apply Lock On.</li><li><b>5+:</b> Every enemy in a blast 1 area must pass a systems save or become Impaired, Jammed, and Slowed until the end of their next turn.</li><li><b>6:</b> The <i>Roger</i> fires its beam weapon, piercing a narrow hole through walls and obstructions. One enemy on the battlefield must pass an agility save or take 3d6+3 AP energy damage, or half on a successful save.</li></ul>The <i>Roger</i> does not need line of sight to activate these effects and it will easily pierce through objects and terrain, though if there are other more potent barriers (such as energy shields that block effects from crossing due to LoS) they will block them normally."
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/gUtbLrv.png"
  }
]