[
  {
    "id": "mf_emperor",
    "source": "SSC",
    "name": "EMPEROR",
    "mechtype": [
      "Support",
      "Artillery"
    ],
    "y_pos": 21,
    "license_level": 2,
    "description": "<p>“In Exotic Materials we don’t have problems. We have doors that are not yet open to us — a ‘problem’ presents endless branching paths; ‘doors’ are binary. Open and shut. The tyranny of the problem lies in the impossible breadth of possibility — a useless framing for tinkerers and hobbyists with time to fret over ethics as-defined by calcified, hand-wringing institutions. EXMAT instead is solutions-focused: there is no such thing as a problem, only a door, and the question: can we open it, or do we have to bash it down?</p><p>For the Emperor we had to bash the door down. Ugly process but the content beyond the door is more than worth it: Syncretic subjectivities, induced gestalt manifestation, H-NHP ontologic bridging, superpositional defensive lensing — look at what the battering ram gave us and tell me you’d rather puzzle out a problem then bash down the door.</p><p>Progress. The Corpro has always been about progress. Humanity has always been about progress. In service of progress, one must accept the necessity of teleological suspension, for it gives us wondrous, necessary things.</p><p>What else is there to say? Long live the Emperor, for in its creation did we find the method by which to fling open every locked door. Wondrous things are coming, and I’m glad as hell that they’ll be under our control.”</p><p>— Memo to personal records, Bala Shimano, CEO-1, Exotic Materials Group</p>",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 2,
      "evasion": 10,
      "edef": 8,
      "heatcap": 5,
      "repcap": 2,
      "sensor_range": 15,
      "tech_attack": 1,
      "save": 11,
      "speed": 5,
      "sp": 7
    },
    "traits": [
      {
        "name": "Storm Shield",
        "description": "The Emperor’s hp does not increase due to grit. Instead, at the start of any scene, the Emperor gains overshield equal to 6 + its grit. This overshield refreshes when the Emperor takes structure damage.",
        "bonuses": [{
          "id": "hp",
          "val": "-{grit}"
        }],
        "synergies": [{
          "locations": ["overshield"],
          "detail": "The Emperor’s hp does not increase due to grit. Instead, at the start of any scene, the Emperor gains overshield equal to 6 + its grit. This overshield refreshes when the Emperor takes structure damage."
        }]
      },
      {
        "name": "Imperial Vestment",
        "description": "Whenever the Emperor grants overshield to another character, it gains the same amount of overshield. If the Emperor gains overshield from any source, including this trait, it increases its current overshield by that amount instead of replacing it. In addition, if that overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced). The Emperor’s current overshield cannot exceed the amount granted by Storm Shield.",
        "synergies": [{
          "locations": ["overshield"],
          "detail": "Whenever the Emperor grants overshield to another character, it gains the same amount of overshield. If the Emperor gains overshield from any source, including this trait, it increases its current overshield by that amount instead of replacing it. In addition, if that overshield had effects, it can inherit those effects, but only the effects of one system at a time (you can choose which is kept or replaced). The Emperor’s current overshield cannot exceed the amount granted by Storm Shield."
        }]
      },
      {
        "name": "Sovereign Presence",
        "description": "1/round, when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 AOE around itself (if it was hit) or its target (if it was the attacker) that deals 1 AP energy damage to all characters caught within other than the Emperor.",
        "synergies": [{
          "locations": ["weapon", "active_effects"],
          "detail": "1/round, when the Emperor hits or is hit by a melee or ranged attack, it can release a burst 1 AOE around itself (if it was hit) or its target (if it was the attacker) that deals 1 AP energy damage to all characters caught within other than the Emperor."
        }]
      }
    ],
    "core_system": {
      "name": "Darian Regalia",
      "description": "",
      "active_name": "Xerxes Apex",
      "active_effect": "For the rest of this scene, when the Marathon Arc is drawn back, each hostile mech character hit and each allied mech character granted overshield by the bow releases a bolt of lightning, striking a character in range 3, which could be the character it originated from. This lightning bolt either deals 2 AP damage (no attack or save) or grants 2 overshield (or increases overshield by the same amount). The same character can be struck by multiple bolts.",
      "activation": "Free",
      "use": "Encounter",
      "integrated": ["mw_emperor_integrated"]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/BGu6Vg6.png"
  },
  {
    "id": "mf_kidd",
    "source": "IPS-N",
    "name": "KIDD",
    "mechtype": [
      "Support"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "<p>Sidegraded from IPS-N’s Lancaster support frame, the Kidd was produced under a joint development contract by IPS-N’s Titan-Enceladus Field Project and Northstar Branch Robotics. The original frame pattern was bought off a mining commune that had rigged their support drones in a slapdash but ingenious neural mesh that both hardened them against tech intrusion and increased their operational efficiency many times over. Urban legend was that the original rig builder had used his drone team to bury caches of black market volador tech in several wandering asteroids, and out of extreme paranoia made his systems almost impossible to crack. To this day Northstar Robotics tries valiantly to squash down persistent rumors that clues to the location of the caches are hidden in the Kidd’s code base.</p><p>Designed to provide an aggressive, all-theater support solution to rugged field teams in hostile environments, the Kidd mounts a trio of powerful systems to ensure a broad operational envelope. The Jolly Roger semi-autonomous personal orbital platform, bundled with all proven-license Kidd platforms establishes theater control in any open or near-surface environment. A squadron of bundled WARCHILD subalterns (and onboard maintenance suite) guarantee friendly support in any environment, and provide a broad suite of tactical possibility. Finally, Titan-Enceladus’ SMOKESTACK heat sink pylon represents the cutting edge of IPS-N’s thermodynamic axiomatics, allowing users to offset an amount of heat via the creation of a pinhole-window into an Omega State of absolute zero.</p><p>The Kidd is in high use in Evergreen as a subaltern command platform, mostly as a civilian and engineering mech. Its familiar bulk is also commonly seen accompanying traders that do business with the gray towns.</p>",
    "mounts": [
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 2,
      "hp": 6,
      "evasion": 6,
      "edef": 12,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 8,
      "tech_attack": 1,
      "save": 11,
      "speed": 6,
      "sp": 10
    },
    "traits": [
      {
        "name": "Rapid Deploy",
        "description": "On its first turn in any combat scene, the Kidd can deploy or activate any one system with the drone or deployable tag as a free action.",
        "actions": [{
          "name": "Rapid Deploy",
          "activation": "Free",
          "frequency": "1/scene",
          "detail": "On its first turn in any combat scene, the Kidd can deploy or activate any one system with the drone or deployable tag as a free action.",
          "synergy_locations": ["deployable", "drone"]
        }]
      },
      {
        "name": "Re-Route Power",
        "description": "As a quick action 1/round, the Kidd can destroy one of its deployables or drones to either grant 1d6+3 overshield to an adjacent ally to that drone or system or deal 1d6+3 ap energy damage to an adjacent enemy to that drone or system. It can’t do this to a drone or deployable that was deployed or created in the same round. Systems without the limited tag destroyed this way must be repaired before becoming usable again.",
        "actions": [{
          "name": "Re-Route Power",
          "activation": "Quick",
          "frequency": "1/round",
          "detail": "As a quick action 1/round, the Kidd can destroy one of its deployables or drones to either grant 1d6+3 overshield to an adjacent ally to that drone or system or deal 1d6+3 ap energy damage to an adjacent enemy to that drone or system. It can’t do this to a drone or deployable that was deployed or created in the same round. Systems without the limited tag destroyed this way must be repaired before becoming usable again.",
          "synergy_locations": ["drone", "deployable"]
        }]
      },
      {
        "name": "Recycle",
        "description": "If the Kidd used Re-Route power in any scene, it gets +1 limited charge back to a system of its choice with the drone or deployable tag.",
        "synergies": [{
          "locations": ["deployable", "drone"],
          "detail": "If the Kidd used Re-Route power in any scene, it gets +1 limited charge back to a system of its choice with the drone or deployable tag."
        }]
      }
    ],
    "core_system": {
      "name": "Jolly Roger Semi-Autonomous Personal Orbital Platform",
      "description": "",
      "active_name": "Skull and Bones",
      "active_effect": "For the rest of the scene the Kidd, the Roger’s first two effects become blast 2 and its beam weapon affects all characters in a line 15 area.",
      "activation": "Free",
      "use": "Encounter",
      "passive_name": "Jolly Roger",
      "passive_effect": "<p>At the start of any combat scene, the Kidd activates an uplink to a paired <i>Jolly Roger</i>, a orbital satellite weapon. The <i>Roger</i> needs to maintain calibration with the Kidd, which you can track with the Jolly Roger die (d6, starting at 1). When one of the following occurs, tick the die up by 1:<ul><li>The Kidd deploys a drone or deployable system</li><li>The Kidd takes a tech action targeting at least one ally</li></ul>Each of these effects can trigger only 1/round independently. However, the die also ticks up by 1 each time a hostile character takes a tech action against an allied character in the Kidd’s sensor range, with no limit.</p><p>As a quick action 1/round, the Kidd can activate a function of the <i>Roger</i>, resetting the die to 1. It can take one of the Jolly Roger actions, depending on the value of the die. The <i>Roger</i> does not need line of sight to activate these effects and it will easily pierce through objects and terrain, though if there are other more potent barriers (such as energy shields that block effects from crossing due to LoS) they will block them normally.</p>",
      "passive_actions": [
        {
          "name": "Jolly Roger 3+",
          "activation": "Quick",
          "detail": "Scan every enemy in a blast 1 area and apply Lock On.",
          "frequency": "1/round"
        },
        {
          "name": "Jolly Roger 5+",
          "activation": "Quick",
          "detail": "Every enemy in a blast 1 area must pass a systems save or become Impaired, Jammed, and Slowed until the end of their next turn.",
          "frequency": "1/round"
        },
        {
          "name": "Jolly Roger 6",
          "activation": "Quick",
          "detail": "The <i>Roger</i> fires its beam weapon, piercing a narrow hole through walls and obstructions. One enemy on the battlefield must pass an agility save or take 3d6+3 AP energy damage, or half on a successful save.",
          "frequency": "1/round"
        }
      ],
      "counters": [{
        "id": "ctr_jolly_roger",
        "name": "Jolly Roger",
        "default_value": 1,
        "min": 1,
        "max": 6
      }]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/gUtbLrv.png"
  },
  {
    "id": "mf_sagarmatha",
    "source": "GMS",
    "name": "SAGARMATHA",
    "mechtype": [
      "Defender"
    ],
    "y_pos": 25,
    "license_level": 0,
    "description": "<p>The Sagarmartha is a size 2 legacy GMS mech that can be chosen by any character from LL0 onwards. Taking the Sagarmartha is not exclusive with the Everest, and all characters have access to it from LL0.</p><p>The Sagarmartha is an older pattern mech than the Everest, sturdy and bulkier by necessity more than design. It seen as somewhat antiquated by modern manufacturing standards. Nevertheless, it sees some use in border colonies, in the Baronies, and with the Albatross.</p>",
    "mounts": [
      "Main",
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 1,
      "hp": 8,
      "evasion": 8,
      "edef": 8,
      "heatcap": 6,
      "repcap": 5,
      "sensor_range": 10,
      "tech_attack": 0,
      "save": 10,
      "speed": 3,
      "sp": 6
    },
    "traits": [
      {
        "name": "Guardian",
        "description": "Adjacent allied characters can use the Sagarmartha as hard cover."
      },
      {
        "name": "Heroism",
        "description": "1/scene the Sagarmartha can brace without sacrificing any actions or movement on its following turn.",
        "synergies": [{
          "locations": ["active_effects"],
          "detail": "1/scene the Sagarmartha can brace without sacrificing any actions or movement on its following turn."
        }]
      },
      {
        "name": "Replaceable Parts",
        "description": "While resting, the Sagarmartha can be repaired at a rate of 1 repair per structure damage instead of 2.",
        "bonuses": [{
          "id": "cheap_struct",
          "val": 1
        }],
        "synergies": [{
          "locations": ["rest"],
          "detail": "The Sagarmatha can be repaired at a rate of 1 Repair per 1 structure damage."
        }]
      }
    ],
    "core_system": {
      "name": "Rallying Cry",
      "description": "",
      "active_name": "Raise the Banner",
      "active_effect": "You raise a rallying banner. All characters in line of sight of your mech when it’s raised gain resistance to all damage and +1 accuracy on attacks, checks, and saves until the start of your next turn.",
      "activation": "Quick",
      "use": "Next Turn"
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/4Os1ZCY.png"
  },
  {
    "id": "mf_tokugawa_alt_enkidu",
    "source": "HA",
    "name": "ENKIDU SHOCK BERSERKER",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "<p>The Enkidu can be taken at Tokugawa License level 2 instead of the base frame, or retrofitted as part of the campaign.</p><p>This experimental frame was a TBK chassis built as a black site project for late-action combat in the Hercynian Crisis. Deployed in limited numbers against the remaining Egregorian hives in the brutal last stages of the war, the Enkidu’s neurological interfacing was dangerous: raw and unshielded. The power and aggression flowing through the subroutines that govern the mech bled into a pilot’s subjectivity, making them lose themselves in a storm of violence, pushing themselves to greater acts of savagery. The result was incredibly hard for pilots to handle, the fallout rate from the program was extremely high, and the survivors required extensive conditioning, implants, and a cocktail of neurological suppressants to continue piloting.</p><p>The aim of the project was not to fight Egregorians, but which were in the final stages of practical extinction, but to use the battlefield as a testing ground for the Enkidu’s eventual deployment against ThirdComm revolutionaries and dissidents. Though the codebase for the Enkidu was eventually discontinued and molded into what is now the Tokugawa, the desperate project never got off the ground before the revolution took hold, and the remaining prototypes were buried with the rest of Hercynia’s history.</p>",
    "mounts": [
      "Flex",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 10,
      "evasion": 10,
      "edef": 6,
      "heatcap": 8,
      "repcap": 3,
      "sensor_range": 5,
      "tech_attack": -2,
      "save": 10,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Primal Savagery",
        "description": "When the Enkidu ends its turn in the Danger Zone, it rears up, extends its plasma talons, and enters the primal savagery state. This has the following effects:<ol><li>It cannot take normal reactions, including overwatch.</li><li>Instead, the Enkidu must instead make an attack as a reaction with its plasma talons against any character (hostile or allied) that enters, exits or moves more than 1 space in its threat range. It can make this reaction 1/turn, but any number of times a round.</li><li>On hit, any character struck by the Enkidu’s plasma talons is immediately immobilized until the start of its next turn.</li><li>This state ends at the start of the Enkidu’s turn.</li></ol>",
        "synergies": [{
          "locations": ["heat"],
          "detail": "When the Enkidu ends its turn in the Danger Zone, it rears up, extends its plasma talons, and enters the primal savagery state."
        }]
      },
      {
        "name": "All Fours",
        "description": "While in the Danger Zone, the Enkidu cannot make ranged attacks but its base speed increases to 6.",
        "synergies": [{
          "locations": ["heat"],
          "detail": "While in the Danger Zone, the Enkidu cannot make ranged attacks but its base speed increases to 6."
        }]
      },
      {
        "name": "Brute Strength",
        "description": "The Enkidu gets +1 accuracy on hull checks and saves.",
        "synergies": [{
          "locations": ["hull"],
          "detail": "The Enkidu gets +1 accuracy on hull checks and saves."
        }]
      }
    ],
    "core_system": {
      "name": "Limit Restriction Zero",
      "description": "<p>“I argue that it is Man who is shapeless; far from immutable, he is given form by the environment around him. In civilization, man is as divine as old God, who judges and creates; he is clothed in finery, and enjoys literature, art, company, and purpose.</p><p>When left alone in the savage wilderness of nature, Man comports himself accordingly.”</p><p>— Harrison II, “Mandate, Vol II: On Nature, On Savagery, On Reason”</p>",
      "active_name": "Crush Limiter",
      "active_effect": "<p>For the rest of the scene, the Enkidu gains the Bifurcate action, which can only be used in the danger zone.</p><p>If the Enkidu failed to destroy any character with this ability at the end of the scene, it’s CP cost is refunded.</p>",
      "activation": "Protocol",
      "use": "Encounter",
      "active_actions": [{
        "name": "Bifurcate",
        "activation": "Full",
        "detail": "The Enkidu engages its monstrous strength, targets an adjacent character and attempts to tear it in half with its talons. If the character has hp equal to 7 or less, only 1 structure remaining, and isn’t immune to damage, it is immediately destroyed, the action cost of this ability is refunded, and the Enkidu can take the boost action as a free action. If this ability fails to destroy the target, the target instead takes 1 kinetic damage."
      }],
      "integrated": ["mw_tokugawa_alt_enkidu_integrated"]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/4Os1ZCY.png"
  },
  {
    "id": "mf_genghis_alt_worldkiller_genghis_mk_i",
    "source": "HA",
    "name": "“WORLDKILLER” GENGHIS MK I",
    "mechtype": [
      "Striker"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "<p>This alternate Genghis can be taken at Genghis LL2 instead of the base frame or dug up and repaired as part of the campaign.</p><p>These old pattern Genghis mechs are buried all over Hercynia, in various states of disrepair and carnage. They are a grim reminder of the carnage that once took place here. Unlike the sleeker, slimmer framed Mk2, the Mk1 is much more brutal in its simplicity - mass produced, a crude weapon.</p>",
    "mounts": [
      "Main",
      "Main",
      "Heavy"
    ],
    "stats": {
      "size": 2,
      "stress": 4,
      "structure": 4,
      "armor": 3,
      "hp": 6,
      "evasion": 6,
      "edef": 8,
      "heatcap": 8,
      "repcap": 4,
      "sensor_range": 5,
      "tech_attack": -2,
      "save": 10,
      "speed": 3,
      "sp": 5
    },
    "traits": [
      {
        "name": "Insulated",
        "description": "The Genghis has immunity to burn."
      },
      {
        "name": "TBK Munitions",
        "description": "The Genghis’s attacks ignore resistance to Burn and Heat."
      },
      {
        "name": "Weak Computer",
        "description": "The Genghis has +1 Difficulty on all SYSTEMS saves and checks.",
        "synergies": [{
          "locations": ["systems"],
          "detail": "The Genghis has +1 Difficulty on all SYSTEMS saves and checks."
        }]
      }
    ],
    "core_system": {
      "name": "JUGGERNAUT REACTOR",
      "description": "Inside his great suit the fireman smiles. He is a salamander upon the world, belching flame, cleaning away history, and leaving a new land for the living.",
      "passive_name": "JUGGERNAUT REACTOR",
      "passive_effect": "While the Genghis is in the Danger Zone, it is surrounded in shimmering heat that interferes with targeting. All characters within a burst 1 area around it other than the Genghis cannot take reactions and characters within have soft cover.",
      "passive_synergies": [{
        "locations": ["heat"],
        "detail": "While the Genghis is in the Danger Zone, it is surrounded in shimmering heat that interferes with targeting. All characters within a burst 1 area around it other than the Genghis cannot take reactions and characters within have soft cover."
      }],
      "active_name": "A PLEASURE TO BURN",
      "active_effect": "<p>For the rest of the scene, the Genghis is wreathed in coruscating heat. In addition to the passive effects above, the Genghis has resistance to kinetic damage while it’s active as munitions vaporize.</p><p>When the Genghis overheats while this effect is active, it releases a blast of heat in the area, melting the ground beneath it. Characters caught within must pass a hull save or take 2d6 energy damage and become immobilized until the end of their next turn. The area then becomes difficult terrain for the rest of the scene.</p>",
      "activation": "Protocol",
      "use": "Encounter",
      "active_synergies": [
        {
          "locations": ["hp"],
          "detail": "The Genghis has resistance to kinetic damage while A PLEASURE TO BURN is active as munitions vaporize."
        },{
          "locations": ["heat"],
          "detail": "When the Genghis overheats while A PLEASURE TO BURN is active, it releases a blast of heat in the area, melting the ground beneath it. Characters caught within must pass a hull save or take 2d6 energy damage and become immobilized until the end of their next turn."
        }
      ]
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/4Os1ZCY.png"
  },
  {
    "id": "mf_swallowtail_alt_swallowtail_ranger_variant",
    "source": "SSC",
    "name": "SWALLOWTAIL (RANGER VARIANT)",
    "mechtype": [
      "Support"
    ],
    "y_pos": 25,
    "license_level": 2,
    "description": "<p>This swallowtail variant is common among HUC ranger forces. It was adopted and reverse engineered from abandoned early SSC expeditions to survey the planet, back when the company learned of Hercynia almost two centuries ago. With no ability to print-replicate the mech, the rangers have painstakingly manfuctured and assembled each one, to high specifications. Unlike the sleek luxury of other SSC frames, this Swallowtail is a highly rugged affair. Each one has a suite of the marks of its previous owners - livery, battle paint, custom gear, camouflage, and weathering. They have been repaired and maintained for two generations and each one is precious to the United Cities.</p><p>This mech can be taken at Swallowtail LL2 instead of the base frame, or gained by aiding Dthall Ordo during the campaign.</p>",
    "mounts": [
      "Flex",
      "Main"
    ],
    "stats": {
      "size": 1,
      "stress": 4,
      "structure": 4,
      "armor": 0,
      "hp": 6,
      "evasion": 10,
      "edef": 8,
      "heatcap": 4,
      "repcap": 5,
      "sensor_range": 20,
      "tech_attack": 1,
      "save": 10,
      "speed": 6,
      "sp": 5
    },
    "traits": [
      {
        "name": "Scout Battlefield",
        "description": "At the start of any combat, before the first round begins and before any characters or NPCs are placed on the battlefield, place up to 2 of the following on the battlefield in free spaces. Options can be chosen more than once. All placed objects or zones are naturally occuring terrain features for the battlefield, and you can work with the GM to decide what they represent. None can be placed within 4 spaces of each other: (1) A 2x2 zone that grant soft cover to characters at least partly inside and can be freely moved through. (2) A 2x2 zone that is difficult terrain. (3) A size 1 piece of hard cover."
      },
      {
        "name": "Invigorating Scanners",
        "description": "1/round when the Swallowtail inflicts Lock On, an allied character in its sensor range and line of sight can move up to its speed as a reaction.",
        "synergies": [{
          "locations": ["lock_on"],
          "detail": "1/round when the Swallowtail inflicts Lock On, an allied character in its sensor range and line of sight can move up to its speed as a reaction."
        }]
      },
      {
        "name": "Weathering",
        "description": "The Swallowtail ignores difficult terrain."
      }
    ],
    "core_system": {
      "name": "Gaia Inheritance",
      "description": "Without the ability to mass produce mechs, outnumbered, and outgunned, the rangers have had to rely on the legacy of Hercynia itself to protect them. Each swallowtail is an ingenious, fast moving suite of meshed software and gear, custom tweaked by hardened warriors over several generations - imperfect in a way that would make an SSC smith shiver. Each wear their own unique name, have their own unique ballad, and are recorded in the osteomemetics of the city.",
      "passive_name": "Grounded",
      "passive_effect": "When the swallowtail ends its turn inside a zone or area of terrain that grants soft cover, it becomes invisible until it exists that zone or area, makes an attack roll, forces a save, or takes any other hostile action that affects another character.",
      "active_name": "Guerrilla Warfare",
      "active_effect": "<p>When this protocol is activated, the swallowtail shoots 3 burst 1 zones of smoke in range 5 and line of sight that grant soft cover to characters at least partly inside. The zones last until the rest of the scene.</p><p>For the rest of the scene, when the swallowtail or any of its allies in its sensor range end their turn in a zone that grants soft cover, they become invisible. This invisibility breaks if they leave the zone, take damage, make an attack roll, force a save, take a reaction, or take any other hostile action that affects another character.</p>",
      "activation": "Protocol",
      "use": "Encounter"
    },
    "data_type": "frame",
    "aptitude": {},
    "image_url": "https://i.imgur.com/4Os1ZCY.png"
  }
]