[
  {
    "id": "ms_pinning_spire",
    "name": "PINNING SPIRE",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_action"
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 1,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Your mech and one character in range 3 and line of sight are immobilized. On any subsequent turn, you can end this effect as a free action, or your target can end it by successfully hitting you with a ranged or melee attack or by passing a hull save as a quick action."
    },
    "description": "“We call it ‘demand-compliance tethering’. Though, that makes it sound as if they have a choice to resist.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_sympathetic_shield",
    "name": "SYMPATHETIC SHIELD",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 2,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "You project a shield of resonant ferrofluid over an allied character in range 5. That character gains overshield 8, but any damage dealt to this overshield before reductions of any kind also deals kinetic damage to you as if the attacker had also damaged you, no matter how far away you are."
    },
    "description": "“Soon enough we realized that shaping weapons from molecules and particles wasn’t enough to justify the conical mag as a system worth platforming. We needed to find a way to make it... more. More visual, tactile, concrete, imposing, thrilling — we needed to sell the next step in realspace control! So with some tuning and, regrettably, input from Visual, we figured out how to define the White Witch: as the most terrifying, alien thing you’ve ever fucking seen.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_camuss_razor",
    "name": "CAMUS’S RAZOR",
    "type": "Shield",
    "sp": 2,
    "tags": [
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_quick_action"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_reaction"
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 2,
    "effect": {
      "effect_type": "Reaction",
      "name": "Camus's Razor",
      "init": "Your mech is capable of projecting a spot magnetic force of incredible power. You can prime this system as a quick action.",
      "trigger": "Once primed, once before the start of your next turn as a reaction when an ally within range 3 and line of sight of you is targeted by an attack or other effect that deals at least partly kinetic or explosive damage",
      "detail": "Before the attack is made you can cause the attack or effect to instead target your mech. This attack or effect transfers no matter if the original could hit you or not (such as a melee attack)."
    },
    "description": "“Manipulating the world around the platform doesn’t end at rearranging the natural/built environment. This was the line that many on the team were afraid to cross, the question we had all asked ourselves once we bracketed the platform: what happens when we apply it to a person? What does existence mean when it can be ended with a thought?”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_ferrospike_barrier",
    "name": "FERROSPIKE BARRIER",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {
        "id": "tg_full_action"
      },
      {
        "id": "tg_deployable"
      }
    ],
    "source": "SSC",
    "license": "WHITE WITCH",
    "license_level": 3,
    "effect": {
      "effect_type": "Deployable",
      "activation": "Full",
      "count": 1,
      "size": 2,
      "hp": 20,
      "evasion": 5,
      "detail": "You project a size 2, 20 HP spray of liquid metal in a free adjacent space that rapidly hardens into wicked spines. The barrier is a solid object that can be used for hard cover by any character, and the first time in a round any character is knocked back into the barrier, that character takes 1d6 AP kinetic damage. You can only have one barrier deployed at a time, if a new one is deployed, the other dissolves."
    },
    "description": "“Again and again the meatheads over at Visual asked us to ‘help them sell’ the platform. What else could we do? We handed them a power that gods of death and war had coveted since Cain cracked a rock over Abel’s head, and they told us, ‘if we can’t see it, we can’t sell it.’ So we mucked around and made another diadematic little wonder for them, the F-Barrier. It’s brilliant. Of course it is. We’re Exotic Materials, brilliance is easy.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_dominions_breadth",
    "name": "DOMINION'S BREADTH",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 1,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "A hostile or allied character in sensor range and line of sight gains overshield 1. When this overshield is lost for any reason, that character releases an electric pulse in a burst 2 area around them. All hostile characters caught within (including the original character, if it was hostile), take 1 AP energy damage and must pass a engineering save or become impaired until the end of their next turn. A hostile character can pass an engineering save as a quick action on their turn to clear this shield."
    },
    "description": "“Our first door in was not, as we thought, from the subject’s neural mapping, but from an image of one of the igneomemetic samples returned by Perfect Execution during their deployment — Darius 1.11: The Golden Fulcrum. With it, we were able to crack the gestalt and begin to translate [Witness]; finding our way into the subject followed shortly thereafter.<br>“A curious note: both records used to reconstruct the Emperor’s subjective superstructure — the Darius and Cyrus memetics — include āyāt from the pre-Meccan Reconstruction Quran, likely from Crisis-era human-egregorian interaction.”",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_the_imperial_eye",
    "name": "THE IMPERIAL EYE",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_shield"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "An allied character in sensor range gains a Disruptive Charge until the start of your next turn. When a hostile character moves to a space within range 3 of that character, the charge sparks to that character, ending this effect. Characters that start their turns within range 3 of the charged character are unaffected until they move outside of that area and re-enter it. The character struck by the charge must pass an engineering save or take 1 AP energy damage, be knocked back 2 spaces, knocked prone, and shredded until the end of their next turn."
    },
    "description": "Darius was the door in; Cyrus was the map. Navigation through the subject’s parasubjective topography was proven on paper. Using a particularized human-nonhuman ontologic bridge, EXMAT was able to demonstrate gestalt manifestation in test pilots; with help, we can do what they do — and do it better.<br>The walls between us and what comes next fall down. The work continues.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_shahnameh",
    "name": "SHAHNAMEH",
    "type": "Tech",
    "sp": 3,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "An allied character in sensor range and line of sight gains Overshield equal to your Grit + 4. While they have this Overshield, they are resistant to Heat inflicted by other characters."
    },
    "description": "“Be recorded in my book of Kings; live into forever and beyond.”<br>— translated gestalt from the Cyrus Omega ferromemetic, no pre-contact text associated; likely a subject-original imperative/corrective impulse.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_ayah_of_the_syzygy",
    "name": "Āyah of the Syzygy",
    "type": "System",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_action"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 3,
    "effect": {
      "effect_type": "Basic",
      "activation": "Quick",
      "detail": "Create a blast 2 area in range and line of sight that lasts until the end of the scene or until you take this action again. The first time each turn a hostile character in this area is hit by a ranged or melee attack, they release a discharge of energy. All hostile characters at least partly in the area, including the original character, take 1 AP energy damage."
    },
    "description": "“So where are you going? Is it not except a reminder to the worlds<br>For whoever wills among you to take a right course.”<br>— Witnessed from the Darius 4.8 igneomemetic*<br>*EXMAT Note: crossref(TRUE): Quran, Surah 81:26-28 “at-Takwir” (pre-Meccan Reconstruction)",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_the_walk_of_kings",
    "name": "THE WALK OF KINGS",
    "type": "Tech",
    "sp": 4,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_overshield"
      },
      {
        "id": "tg_shield"
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_limited",
        "val": 3
      }
    ],
    "source": "SSC",
    "license": "EMPEROR",
    "license_level": 3,
    "effect": {
      "effect_type": "Tech",
      "activation": "Full",
      "detail": "An allied character in sensor range and line of sight gains overshield equal to your Grit +4. While they have this overshield, all their melee attacks gain the AP tag, and the first time each turn that they either hit with a melee attack or take damage from a hostile character, they release a burst 1 AOE centered on them. All hostile characters caught within take 1 AP Energy damage."
    },
    "description": "“VERILY we established HIS power on earth and We gave HIM the ways and means to all ends.”<br>— Witnessed from the Darius 5.10 igneomemetic*<br>*EXMAT Note: crossref(TRUE): Quran, Surah 18:84 “al-Khaf” (pre-Meccan Reconstruction). Fascinating that this should appear from the gestalt — human/egregorian interaction on Hercynia post-Crisis must have been quite developed for this (and previous) excerpts to be so deep-set. Encouraging signs for further development.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_pebcap",
    "name": "PEBCAP",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IPS-N",
    "license": "KIDD",
    "license_level": 1,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "An allied mech character in sensor range and line of sight quickly flash reboots from the system level. This ends all effects caused by tech actions, stops NHP cascade, and the affected character becomes immune to all tech actions other than this one (hostile or allied) until the end of their next turn. Roll 1d6 for side effects. These effects take place immediately, don’t take an action or reaction, and any movement taken is involuntary.<ul><li>1 - Character becomes jammed until the end of their next turn</li><li>2 - Character moves up to its speed in a direction of the GM’s choice</li><li>3 - Character immediately moves up to 3 spaces towards the nearest character (allied or hostile) and takes the improvised attack action against that character. If no characters are in range, it only moves.</li><li>4 - Character falls prone</li><li>5 - Character vents 1d6 heat and deals the amount cooled as energy damage to all adjacent characters</li><li>6 - Character immediately takes the stabilize action and can choose what to do.</li></ul>"
    },
    "description": "When the problem exists between a chassis and its pilot, the only thing to do is fix it for them. This rather quick solution is an old system level reboot program, often used by asteroid miners dealing with aging hardware.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_omnibus_plate",
    "name": "Omnibus Plate",
    "type": "Deployable",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_action"
      },
      {
        "id": "tg_limited",
        "val": 3
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_deployable"
      }
    ],
    "source": "IPS-N",
    "license": "KIDD",
    "license_level": 2,
    "effect": {
      "effect_type": "Deployable",
      "activation": "Quick",
      "count": 1,
      "size": 1,
      "hp": 10,
      "evasion": 5,
      "detail": "On activation, creates a size 1 Omnibus Plate in range 5. The plate cannot be moved, is flat, and does not block movement. The plate can fit a single size 1 or smaller drone or deployable at a time. Drones or deployables placed inside gain resistance to all damage and increase the size of any burst or blast effects they generate by +1. Any of the drone or deployable’s effects that require adjacency can now be activated from within range 2."
    },
    "description": "Northstar Branch Robotics returned to their roots with the Omnibus Plate, creating a simple, deployable catalytic for frontline nexus users. Designed with adaptation in mind, Omnibus Plates can attach securely to any drone or deployable system, increasing that drone or deployable’s efficacy in all aspects of employ.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_field_approved_brass_ignorant_modifications",
    "name": "Field-Approved, Brass-Ignorant Modifications",
    "type": "Tech",
    "sp": 2,
    "tags": [
      {
        "id": "tg_quick_tech"
      },
      {
        "id": "tg_unique"
      }
    ],
    "source": "IPS-N",
    "license": "KIDD",
    "license_level": 2,
    "effect": {
      "effect_type": "Tech",
      "activation": "Quick",
      "detail": "Choose an allied mech character in sensor range and line of sight. That ally takes 1 heat and their next ranged weapon attack gains Overkill, AP, and deals +1d6 bonus damage, but the weapon cannot be fired next round as it become massively hot."
    },
    "description": "FABI modifications are, as implied by the name, battlefield modifications made on any weapon system by engineers that, while <i>technically</i> falling well outside the approved envelope of functionality and safety, are nonetheless popular among veteran pilots. FABI mods tend to be temporary in nature: removal of joule governors via quick-patched code, field-cooked “hot” kinetic rounds, and so on.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_warchild_2_subalterns",
    "name": "WARCHILD-2 Subalterns",
    "type": "Drone",
    "sp": 4,
    "tags": [
      {
        "id": "tg_quick_action"
      },
      {
        "id": "tg_limited",
        "val": 6
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_drone"
      }
    ],
    "source": "IPS-N",
    "license": "KIDD",
    "license_level": 3,
    "effect": {
      "effect_type": "Drone",
      "size": 1,
      "hp": 6,
      "edef": 10,
      "evasion": 10,
      "heat": 6,
      "detail": "On activation, spend a charge and create a squad of WARCHILD-2 combat subalterns in a free adjacent space. The squad is made up of three armed, humanoid drones that follow direct commands issued by their commander. They are treated as a single unit, sharing the same space and move as a unit (even if moved involuntarily). The members are size 1/2 for movement, engagement, etc...<br>WARCHILD-2 subaltern subaltern squads cannot take actions, reactions, or movement normally. WC-2 subalterns’ max HP cannot be increased other than combining (see below) but they can benefit from armor, resistance, cover, etc or other effects. If they overheat, they are stunned until the end of their next turn and then clear all heat.",
      "abilities": [{
        "effect_type": "Basic",
        "activation": "Quick",
        "detail": "When activated, and as a quick action on your turn, you can instruct all WARCHILD-2 squads to move up to 4 spaces in a direction of your choice as long as they are in your sensor range and you are not jammed."
      }, {
        "effect_type": "Basic",
        "activation": "Quick",
        "detail": "On each turn as a single quick action, you can issue all active subaltern squads one of the following issued commands (just a quick action, no matter how many squads are active). You can choose different commands for each squad if you have multiple active. The subalterns must be in your sensor range and you must not be jammed for them to receive commands. If the squads don’t receive a command, they take the Form Up command.<ul><li><b>Attack:</b> The WARCHILD-2 squad makes a ranged attack roll against a target in range 5 and line of sight, using your grit. On hit, they deal kinetic damage equal to half their hp.</li><li><b>Defend:</b> WARCHILD-2 subalterns may latch on to an adjacent allied mech or drone character, then disarticulate to form a new layer of armor. Squads that do this are destroyed, but that character gains overshield equal to the squad’s HP.</li><li><b>Form Up:</b> The WARCHILD-2 subalterns gain resistance to all damage and lock shields. Until they receive another order, they cannot move, become immune to involuntary movement, obstruct movement for size 1 characters or smaller, and grant hard cover to allied characters.</li><li><b>Combine:</b> WARCHILD-2 squads may combine with any other adjacent squads, combining their current and max hp and heat cap to a maximum of 10. They retain any heat and conditions from either squad. You can choose which squad’s location is the final location for the newly formed squad.</li></ul>"
      }]
    },
    "description": "The WARCHILD line of subalterns are IPS-N’s premier frontline autonomous robotic humanoids. Produced by their robotics division, Northstar Branch Robotics, WARCHILD-2 subalterns are the newest of NBR’s combat models, built to user scale and function. Armored with heavy k-padding and energy dispersal ceramics, WARCHILD-2 units stand a little over 2.5 meters tall and are rated for high-impact/trade combat; these subalterns can interact with any weapon system usable by humans via their stock manipulators, and can be upgraded to manipulate fine-motor interfaces with near-1:1 fidelity function via specialization packs. Further hardening to their core processing units and tightbeam connectivity nets insulate WARCHILD-2 subalterns against causal and paracausal agents, ensuring unit loyalty and functionality against a wide spectrum of known and unknowable threats.",
    "data_type": "system",
    "aptitude": {}
  },
  {
    "id": "ms_smokestack_heatsink",
    "name": "SMOKESTACK Heatsink",
    "type": "Deployable",
    "sp": 3,
    "tags": [
      {
        "id": "tg_quick_action"
      },
      {
        "id": "tg_limited",
        "val": 2
      },
      {
        "id": "tg_unique"
      },
      {
        "id": "tg_deployable"
      }
    ],
    "source": "IPS-N",
    "license": "KIDD",
    "license_level": 3,
    "effect": {
      "effect_type": "Deployable",
      "activation": "Quick",
      "count": 1,
      "size": 0.5,
      "hp": 5,
      "evasion": 10,
      "heat": 10,
      "detail": "When deployed as a quick action, this deployable creates a burst 2 zone around itself, absorbing any heat added to any characters at least partially in the area from any source (before reduction, such as resistance). Once the pylon hits 10 heat, it explodes. Characters caught in the zone must pass an agility save or take 2d6 AP energy damage, or half on a successful save. Objects and deployables are hit automatically. Any excess heat absorbed by the pylon as part of the same action or effect that caused it to explode disperses and has no effect."
    },
    "description": "The IPS-N Kidd’s SMOKESTACK Heatsink represent the latest in IPS-N’s heat dispersion systems for chassis and other CORE-powered vehicles and vessels. Utilizing proprietary axiomatics, the SMOKESTACK system establishes (via deployable pylon) a localized, minor, and stable pinhole into an Omega state, allowing users to — for a certain value of thermodynamic exchange — cool excess heat debt via depositing it <i>into</i> that Omega State. Once the SMOKESTACK reaches capacity — a hard-coded feature — it detonates, making the system just as effective a weapon as it is a heat sink.",
    "data_type": "system",
    "aptitude": {}
  }
]